# ðŸ’¾ Data Loading

### Data:
1. **train.csv**: Sales time series data with features like `store_nbr`, `family`, and `onpromotion`.
2. **test.csv**: Similar to `train.csv`, used for sales prediction on provided dates.
3. **sample_submission.csv**: Sample submission file format for predictions.
4. **stores.csv**: Store metadata including `city`, `state`, `type`, and `cluster` grouping.
5. **oil.csv**: Daily oil prices, important for Ecuador's oil-dependent economy.
6. **holidays_events.csv**: Information on holidays and events, including transferred dates and bridge days.

### How to?:
 1. Import `load_data` from `data_preprocessing.py`, this shall return you the dataframes of the said csv's.

In [24]:
import data_preprocessing as dp
import util as ut

train_data, test_data, stores_data, oil_data, holidays_data = dp.load_data()

In [25]:
train_data.head()

   id        date  store_nbr      family  sales  onpromotion
0   0  2013-01-01          1  AUTOMOTIVE    0.0            0
1   1  2013-01-01          1   BABY CARE    0.0            0
2   2  2013-01-01          1      BEAUTY    0.0            0
3   3  2013-01-01          1   BEVERAGES    0.0            0
4   4  2013-01-01          1       BOOKS    0.0            0

In [26]:
test_data.head()

        id        date  store_nbr      family  onpromotion
0  3000888  2017-08-16          1  AUTOMOTIVE            0
1  3000889  2017-08-16          1   BABY CARE            0
2  3000890  2017-08-16          1      BEAUTY            2
3  3000891  2017-08-16          1   BEVERAGES           20
4  3000892  2017-08-16          1       BOOKS            0

In [27]:
stores_data.head()

   store_nbr           city                           state type  cluster
0          1          Quito                       Pichincha    D       13
1          2          Quito                       Pichincha    D       13
2          3          Quito                       Pichincha    D        8
3          4          Quito                       Pichincha    D        9
4          5  Santo Domingo  Santo Domingo de los Tsachilas    D        4

In [28]:
oil_data.head()

         date  dcoilwtico
0  2013-01-01         NaN
1  2013-01-02       93.14
2  2013-01-03       92.97
3  2013-01-04       93.12
4  2013-01-07       93.20

In [ ]:
holidays_data.head()